Project/Toir.Adaptation/src/DataProcessors/торо_ПанельАдминистрированияТОиР/торо_ПанельАдминистрированияТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПанельАдминистрированияТОиР</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Project/Toir.Adaptation/src/InformationRegisters/торо_НастройкиСогласованияДокументовТОиР/торо_НастройкиСогласованияДокументовТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="76fdcff5-ea27-4ce4-995b-ba054956d27f">
  <name>торо_НастройкиСогласованияДокументовТОиР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="017bf557-165a-4b3c-b248-d479e30f0986">
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ea9f51f7-5e46-4048-8bf9-835599b5dd9f">
    <name>гкс_ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="704f368c-ff91-4d81-a625-c349e9f696e8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7b25050a-54e2-4fa5-aa78-db38f28d44a1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b7f7ac30-29b0-4416-a4db-4fa622173b7c">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/DataProcessors/торо_ПанельАдминистрированияТОиР/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НЭлем = Команды.Добавить("ОткрытьНастройкуГруппФайлов");
	НЭлем.Действие = "ОткрытьНастройкуГруппФайлов";
	НЭлем.Заголовок = НСтр("ru='Группы присоединенных файлов';en='Groups of attached files'");
	
	НЭлем = Элементы.Добавить("гкс_ОткрытьНастройкуГруппФайлов", Тип("КнопкаФормы"), Элементы.СтраницаОбщие);
	НЭлем.ИмяКоманды = "ОткрытьНастройкуГруппФайлов";
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт"))
		И РольДоступна("гкс_РедактированиеИерархииФайлов") = Ложь Тогда 
	// гкс- [Релиз19]
		НЭлем.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&Перед("ПриЗаписиНаСервере")
Процедура Расш_гкс_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Константы.торо_ДатаНачалаФиксацииПеремещенийМеждуФМ.Установить(ЭтотОбъект["ДатаФиксацииМеремещенийФМ"]);
	Константы.гкс_РазрешитьПрисоединенныеФайлыТОИР.Установить(ЭтотОбъект["гкс_РазрешитьПрисоединенныеФайлыТОИР"]);
	Константы.гкс_СобытиеИстеченияСрокаСогласования.Установить(ЭтотОбъект["гкс_СобытиеИстеченияСрокаСогласования"]);
	Константы.гкс_СобытиеПросрочкиСрокаСогласования.Установить(ЭтотОбъект["гкс_СобытиеПросрочкиСрокаСогласования"]);
	Константы.гкс_КолвоДнейДоОкончанияСрокаСогласования.Установить(ЭтотОбъект["гкс_КолвоДнейДоОкончанияСрокаСогласования"]);
	Константы.гкс_СобытиеПросрочкиМероприятияЕвобланк.Установить(ЭтотОбъект["гкс_СобытиеПросрочкиМероприятияЕвобланк"]);
	// гкс+ [11.22] Деснол 17.11.2022
	Константы.гкс_СобытиеПереносРемонтаЗаявки.Установить(ЭтотОбъект["гкс_СобытиеПереносРемонтаЗаявки"]);
	Константы.гкс_ОтключитьМногоязычностьОР.Установить(ЭтотОбъект["гкс_ОтключитьМногоязычностьОР"]);
	// гкс- [11.22] Деснол 17.11.2022
	// гкс+ [03.23] Деснол 24.03.2023
	Константы.гкс_СкрытьСтоимостьРемонта.Установить(ЭтотОбъект["гкс_СкрытьСтоимостьРемонта"]);
	// гкс- [03.23] Деснол 24.03.2023
	Константы.торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ.Установить(
		ЭтотОбъект["торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ"]);
	Константы.гкс_ПараметрыОповещенияОИзмененииТехКарты.Установить(
		ЭтотОбъект["гкс_ПараметрыОповещенияОИзмененииТехКарты"]);
	// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{      
	Константы.гкс_ПериодДействияТехКартПоУмолчанию.Установить(
		ЭтотОбъект["гкс_ПериодДействияТехКартПоУмолчанию"]); 
	Константы.гкс_КоличествоПериодовДействияТехКартПоУмолчанию.Установить(
		ЭтотОбъект["гкс_КоличествоПериодовДействияТехКартПоУмолчанию"]); // } Гкс-[TOIR20-194] 			
	// Гкс+[TOIR20-171] Селимов от 17.11.2020. Добавлено:{      
	Константы.гкс_КоличествоДнейДоОкончанияАктуальностиТК.Установить(
		ЭтотОбъект["гкс_КоличествоДнейДоОкончанияАктуальностиТК"]); // } Гкс-[TOIR20-171] 			
	// гкс+ [10.23] Деснол 28.02.2024
	Константы.гкс_СобытиеПроведенияСметыПожаротушения.Установить(
		ЭтотОбъект["гкс_СобытиеПроведенияСметыПожаротушения"]); 
	// гкс- [10.23] Деснол 28.02.2024
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьНастройкуГруппФайлов(Команда)
	ОткрытьФорму("Обработка.торо_ПанельАдминистрированияТОиР.Форма.ФормаНастройкиИерархииФайлов",,,,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ДатаФиксацииМеремещенийФМ", Новый ОписаниеТипов("Дата")));
	// гкс+ [Релиз 1] Куст 20.01.2021
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_РазрешитьПрисоединенныеФайлыТОИР", Новый ОписаниеТипов("Булево")));
	// гкс- [Релиз 1] Куст 20.01.2021
	МассивРеквизитов.Добавить(Новый РеквизитФормы("торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ",
	Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПараметрыОповещенияОИзмененииТехКарты",
	Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодразделениеИсполнитель", 
		Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"),"СпособыСогласованияПоУмолчанию"));
	// Гкс+[TOIR20-171] Селимов от 17.11.2020. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПериодДействияТехКартПоУмолчанию",
	Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"))); 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КоличествоПериодовДействияТехКартПоУмолчанию",
	Новый ОписаниеТипов("Число")));	// } Гкс-[TOIR20-194] 	
	// Гкс+[TOIR20-171] Селимов от 17.11.2020. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КоличествоДнейДоОкончанияАктуальностиТК",
	Новый ОписаниеТипов("Число"))); // } Гкс-[TOIR20-171] 	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СобытиеИстеченияСрокаСогласования", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СобытиеПросрочкиСрокаСогласования", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КолвоДнейДоОкончанияСрокаСогласования", 
		Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3))));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СобытиеПросрочкиМероприятияЕвобланк", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СобытиеПереносРемонтаЗаявки", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтключитьМногоязычностьОР",
		Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СкрытьСтоимостьРемонта",
		Новый ОписаниеТипов("Булево")));     
	// гкс+ [10.23] Деснол 28.02.2024
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СобытиеПроведенияСметыПожаротушения", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СобытияУведомленийВДокументах")));
	// гкс- [10.23] Деснол 28.02.2024
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["гкс_СкрытьСтоимостьРемонта"] = Константы.гкс_СкрытьСтоимостьРемонта.Получить();
	ЭтотОбъект["ДатаФиксацииМеремещенийФМ"] = Константы.торо_ДатаНачалаФиксацииПеремещенийМеждуФМ.Получить();
	ЭтотОбъект["гкс_РазрешитьПрисоединенныеФайлыТОИР"] = Константы.гкс_РазрешитьПрисоединенныеФайлыТОИР.Получить();
	ЭтотОбъект["гкс_СобытиеИстеченияСрокаСогласования"] = Константы.гкс_СобытиеИстеченияСрокаСогласования.Получить();
	ЭтотОбъект["гкс_СобытиеПросрочкиСрокаСогласования"] = Константы.гкс_СобытиеПросрочкиСрокаСогласования.Получить();
	ЭтотОбъект["гкс_КолвоДнейДоОкончанияСрокаСогласования"] = Константы.гкс_КолвоДнейДоОкончанияСрокаСогласования.Получить();
	ЭтотОбъект["гкс_СобытиеПросрочкиМероприятияЕвобланк"] = Константы.гкс_СобытиеПросрочкиМероприятияЕвобланк.Получить();
	// гкс+ [11.22] Деснол 17.11.2022
	ЭтотОбъект["гкс_СобытиеПереносРемонтаЗаявки"] = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
	ЭтотОбъект["гкс_ОтключитьМногоязычностьОР"] = Константы.гкс_ОтключитьМногоязычностьОР.Получить();
	// гкс- [11.22] Деснол 17.11.2022
	ЭтотОбъект["торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ"] = 
		Константы.торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ.Получить();
	ЭтотОбъект["гкс_ПараметрыОповещенияОИзмененииТехКарты"] = 
		Константы.гкс_ПараметрыОповещенияОИзмененииТехКарты.Получить();
	// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
	ЭтотОбъект["гкс_ПериодДействияТехКартПоУмолчанию"] = 
		Константы.гкс_ПериодДействияТехКартПоУмолчанию.Получить();  	
	ЭтотОбъект["гкс_КоличествоПериодовДействияТехКартПоУмолчанию"] = 
		Константы.гкс_КоличествоПериодовДействияТехКартПоУмолчанию.Получить(); // } Гкс-[TOIR20-194] 	
	// Гкс+[TOIR20-171] Селимов от 17.11.2020. Добавлено:{
	ЭтотОбъект["гкс_КоличествоДнейДоОкончанияАктуальностиТК"] = 
		Константы.гкс_КоличествоДнейДоОкончанияАктуальностиТК.Получить(); // } Гкс-[TOIR20-171] 	
	// гкс+ [10.23] Деснол 28.02.2024
	ЭтотОбъект["гкс_СобытиеПроведенияСметыПожаротушения"] = 
		Константы.гкс_СобытиеПроведенияСметыПожаротушения.Получить();
	// гкс- [10.23] Деснол 28.02.2024
	//
	НЭлем = Элементы.Добавить("Элемент_ДатаФиксацииМеремещенийФМ", Тип("ПолеФормы"), Элементы.СтраницаОбщие);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ДатаФиксацииМеремещенийФМ";
	НЭлем.Заголовок = НСтр("en='Start date of fixing the displacement between the FP';
	| es='La fecha de inicio de la fijación de movimientos entre fm';
	| ru='Дата начала фиксации перемещений между ФМ'");
	НЭлем.УстановитьДействие("ПриИзменении", "дс_КонстантаПриИзменении");
	
	НЭлем = Элементы.Добавить("Элемент_торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ",
		Тип("ПолеФормы"), Элементы.Группа1);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ";
	НЭлем.Заголовок = НСтр("ru = 'Параметры оповещения о проверке оборудования на функциональных местах';
	| en = 'Alert settings on the inspection of equipment at functional locations';
	| es = 'Configuración de alertas de inspección de equipos funcionales lugares'");
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	
	НЭлем = Элементы.Добавить("Элемент_гкс_ПараметрыОповещенияОИзмененииТехКарты",
		Тип("ПолеФормы"), Элементы.Группа1);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ПараметрыОповещенияОИзмененииТехКарты";
	НЭлем.Заголовок = НСтр("ru = 'Параметры оповещения о изменении тех карты';
	| en = 'Parameters of notification about changes to standard maintenance plan';
	| es = ''");
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	//
	// Гкс+[TOIR20-171] Селимов от 17.11.2020. Добавлено:{
	НЭлем = Элементы.Добавить("Элемент_гкс_КоличествоДнейДоОкончанияАктуальностиТК",
		Тип("ПолеФормы"), Элементы.СтраницаОбщие);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_КоличествоДнейДоОкончанияАктуальностиТК";
	НЭлем.Заголовок = НСтр("ru = 'Количество дней до окончания актуальности тех карт';
	| en = 'The number of days until the end of the relevance of the technological maps';
	| es = 'El número de días hasta el final de la validez de los mapas tecnológicos'");
	Элементы.Переместить(Элементы["Элемент_гкс_КоличествоДнейДоОкончанияАктуальностиТК"], Элементы.СтраницаОбщие,
			Элементы.ВерсияППРиТаблСоотв);
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении"); // } Гкс-[TOIR20-171] 
	//
	// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
	НоваяГруппа = Элементы.Добавить("гкс_ГруппаПериодыДействияТК", Тип("ГруппаФормы"));
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;  
	Элементы.Переместить(Элементы["гкс_ГруппаПериодыДействияТК"], Элементы.СтраницаОбщие, Элементы.ВерсияППРиТаблСоотв);
	Элементы["гкс_ГруппаПериодыДействияТК"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НЭлем = Элементы.Добавить("Элемент_гкс_КоличествоПериодовДействияТехКартПоУмолчанию",
		Тип("ПолеФормы"), Элементы["гкс_ГруппаПериодыДействияТК"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Ширина = 2;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.РастягиватьПоГоризонтали = Ложь; 
	НЭлем.ПутьКДанным = "гкс_КоличествоПериодовДействияТехКартПоУмолчанию";
	НЭлем.Заголовок = НСтр("ru = 'Период действия тех карт по умолчанию';
	| en = 'Period of action tech card after silence';
	| es = 'Período de tarjeta técnica de acción después del silencio'");
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении"); 	
	//	
	НЭлем = Элементы.Добавить("Элемент_гкс_ПериодДействияТехКартПоУмолчанию",
		Тип("ПолеФормы"), Элементы["гкс_ГруппаПериодыДействияТК"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ПериодДействияТехКартПоУмолчанию";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении"); // } Гкс-[TOIR20-194]   
	//
	НЭлем = Элементы.Добавить("Элементгкс_ПодразделениеИсполнитель", Тип("ПолеФормы"),
			Элементы.СпособыСогласованияПоУмолчанию);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "СпособыСогласованияПоУмолчанию.гкс_ПодразделениеИсполнитель";
	НЭлем.Заголовок = НСтр("ru = 'Подразделение-исполнитель';
	| en = 'Executive unit';
	| es = ''");
	Элементы.Переместить(Элементы["Элементгкс_ПодразделениеИсполнитель"], Элементы.СпособыСогласованияПоУмолчанию,
			Элементы.СпособыСогласованияПоУмолчаниюСпособСогласования);
	//
	// гкс+ [Релиз 1] Куст 20.01.2021
	НЭлем = Элементы.Добавить("гкс_РазрешитьПрисоединенныеФайлыТОИР", Тип("ПолеФормы"),
			Элементы.СтраницаОбщие);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_РазрешитьПрисоединенныеФайлыТОИР";
	НЭлем.Заголовок = НСтр("ru = 'Разрешить присоединенные файлы ТОИР';
	| en = 'Permitir archivos adjuntos TOIR';
	| es = ''");
	// гкс- [Релиз 1] Куст 20.01.2021
	// гкс+ [разработка 2021] Куст 29.04.2021
	НоваяГруппаФормы = Элементы.Вставить("гкс_ГруппаСрокСогласования", Тип("ГруппаФормы"),
		Элементы.СтраницаНапоминанияИУведомления, Элементы.НастройкаУведомлений);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.Сквозноевыравнивание = СквозноеВыравнивание.Использовать;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	//
	НоваяГруппаФормы = Элементы.Вставить("гкс_ГруппаСрокСогласования1", Тип("ГруппаФормы"),
		Элементы.СтраницаНапоминанияИУведомления, Элементы.НастройкаУведомлений);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.Сквозноевыравнивание = СквозноеВыравнивание.Использовать;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	//
	НЭлем = Элементы.Добавить("гкс_СобытиеИстеченияСрокаСогласования", Тип("ПолеФормы"),
			Элементы["гкс_ГруппаСрокСогласования1"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СобытиеИстеченияСрокаСогласования";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Параметры оповещения о истечении срока согласования';
	| en = 'Negotiation expired alert options';
	| es = ''");
	//
	НЭлем = Элементы.Добавить("гкс_КолвоДнейДоОкончанияСрокаСогласования", Тип("ПолеФормы"),
			Элементы["гкс_ГруппаСрокСогласования1"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_КолвоДнейДоОкончанияСрокаСогласования";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Количество дней до окончания срока согласования';
	| en = 'Number of days until the end of the approval period';
	| es = ''");
	//
	НЭлем = Элементы.Добавить("гкс_СобытиеПросрочкиСрокаСогласования", Тип("ПолеФормы"),
			Элементы["гкс_ГруппаСрокСогласования"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СобытиеПросрочкиСрокаСогласования";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Параметры оповещения о просрочке срока согласования';
	| en = 'Options for notification of late approval';
	| es = ''");
	//
	// гкс+ [11.22] Деснол 17.11.2022
	НЭлем = Элементы.Добавить("гкс_СобытиеПереносРемонтаЗаявки", Тип("ПолеФормы"),
			Элементы["СтраницаОбщие"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СобытиеПереносРемонтаЗаявки";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Параметры оповещения о переносе дат ремонтов заявок';
	| en = 'Options for notification of late approval';
	| es = ''");
	НЭлем = Элементы.Добавить("гкс_СобытиеПросрочкиМероприятияЕвобланк", Тип("ПолеФормы"),
			Элементы["СтраницаОбщие"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СобытиеПросрочкиМероприятияЕвобланк";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Событие просрочки срока выполнения мероприятия EWO-бланка';
	| en = '';
	| es = ''");
	//гкс_СобытиеПроведенияСметыПожаротушения
	НЭлем = Элементы.Добавить("гкс_СобытиеПроведенияСметыПожаротушения", Тип("ПолеФормы"),
			Элементы["СтраницаОбщие"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СобытиеПроведенияСметыПожаротушения";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Событие проведения сметы на работы пожаротушения';
	| en = '';
	| es = ''");
	//
	НЭлем = Элементы.Добавить("гкс_ОтключитьМногоязычностьОР", Тип("ПолеФормы"),
			Элементы["СтраницаОбщие"]);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_ОтключитьМногоязычностьОР";
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.Заголовок = НСтр("ru = 'Отключить многоязычность объектов ремонта';
	| en = '';
	| es = ''");
	//
	// гкс- [11.22] Деснол 17.11.2022
	Элементы.Группа1.Сквозноевыравнивание = СквозноеВыравнивание.Использовать;
	// гкс- [разработка 2021] Куст 29.04.2021
	// гкс+ [03.23] Деснол 24.03.2023
	НЭлем = Элементы.Добавить("гкс_СкрытьСтоимостьРемонта", Тип("ПолеФормы"), Элементы.УправлениеНарядамиИРаботами);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.УстановитьДействие("ПриИЗменении", "дс_КонстантаПриИзменении");
	НЭлем.ПутьКДанным = "гкс_СкрытьСтоимостьРемонта";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НЭлем.Заголовок = НСтр("ru = 'Скрыть стоимость ремонта на форме сметы'");
	// гкс- [03.23] Деснол 24.03.2023
КонецПроцедуры

&НаКлиенте
Процедура дс_КонстантаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	дс_ЛокализоватьГрафическиеСхемы();
	//ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаСервере
Процедура дс_ЛокализоватьГрафическиеСхемы()
	ГрафическиеСхемы = дс_ПолучитьГрафическиеСхемы();
	НаименованияЭлементов = дс_ПолучитьПереводыНазванийЭлементовСхем();
	дс_ПрименитьНаименованияКСхемам(ГрафическиеСхемы, НаименованияЭлементов);
КонецПроцедуры

&НаСервере
Процедура дс_ПрименитьНаименованияКСхемам(ГрафическиеСхемы, НаименованияЭлементов)
	Для каждого ГрафическаяСхема Из ГрафическиеСхемы Цикл
		Для каждого ЭлементСхемы Из ГрафическаяСхема.ЭлементыГрафическойСхемы Цикл
			ЭлементСхемы.Наименование = НаименованияЭлементов[ЭлементСхемы.Наименование];
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция дс_ПолучитьГрафическиеСхемы()
	ГрафическиеСхемы = Новый Массив;
	
	ГрафическиеСхемы.Добавить(ГрафСхемаВнешниеОснованияИДефекты);
	ГрафическиеСхемы.Добавить(ГрафСхемаДополнительно);
	ГрафическиеСхемы.Добавить(ГрафСхемаМероприятия);
	ГрафическиеСхемы.Добавить(ГрафСхемаПланГрафикППР);
	
	Возврат ГрафическиеСхемы;
КонецФункции

&НаСервере
Функция дс_ПолучитьПереводыНазванийЭлементовСхем()
	НаименованияЭлементов = Новый Соответствие;
	
	НаименованияЭлементов.Вставить("Дефект", 					
	НСтр("ru = 'Дефект'; en = 'Defect'; es = 'El defecto'"));
	НаименованияЭлементов.Вставить("Заявка", 					
	НСтр("ru = 'Заявка'; en = 'Application'; es = 'La demanda'"));
	НаименованияЭлементов.Вставить("Акт", 						
	НСтр("ru = 'Акт'; en = 'Act'; es = 'El acta'"));
	НаименованияЭлементов.Вставить("Наряд", 					
	НСтр("ru = 'Наряд'; en = 'Outfit'; es = 'El vestido'"));
	НаименованияЭлементов.Вставить("Наработка", 				
	НСтр("ru = 'Наработка'; en = 'Operating time'; es = 'La elaboraciуn'"));
	НаименованияЭлементов.Вставить("Контролируемые показатели", 
	НСтр("ru = 'Контролируемые показатели'; en = 'Controlled indicators'; es = 'Los нndices controlados'"));
	НаименованияЭлементов.Вставить("График мероприятий", 		
	НСтр("ru = 'График мероприятий'; en = 'Event Schedule'; es = 'El grбfico de las medidas'"));
	НаименованияЭлементов.Вставить("Внешнее основание", 		
	НСтр("ru = 'Внешнее основание'; en = 'External base'; es = 'La razуn exterior'"));
	НаименованияЭлементов.Вставить("Состояние ОР", 				
	НСтр("en='EI status';es='El estado ОР';ru='Состояние ОР'"));
	НаименованияЭлементов.Вставить("Акт приемки оборудования", 	
	НСтр("ru = 'Акт приемки оборудования'; en = 'Equipment acceptance certificate'; es = 'Los нndices controlados'"));
	НаименованияЭлементов.Вставить("Выявленные дефекты", 		
	НСтр("ru = 'Выявленные дефекты'; en = 'Defects Identified'; es = 'El grбfico de las medidas'"));
	НаименованияЭлементов.Вставить("ППР", 						
	НСтр("ru = 'ППР'; en = 'PPM'; es = 'PPM'"));
	
	Возврат НаименованияЭлементов;
КонецФункции

&НаСервере
Функция гкс_ПроверитьДублиСтрок(ВидДокумент, Организация, Подразделение, ПодрИсп)
	
	тз = СпособыСогласованияПоУмолчанию.Выгрузить();
	Если ВидДокумент = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт ИЛИ
				ВидДокумент = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты ИЛИ
				ВидДокумент = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот ИЛИ
				ВидДокумент = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот Тогда 
		найс = тз.НайтиСтроки(Новый Структура("ВидДокумента, Организация, Подразделение, гкс_ПодразделениеИсполнитель", ВидДокумент, Организация, Подразделение, ПодрИсп));
	Иначе
		найс = тз.НайтиСтроки(Новый Структура("ВидДокумента, Организация, Подразделение", ВидДокумент, Организация, Подразделение));
	КонецЕсли;
	
	Если найс.Количество() > 1 Тогда
		ШаблонСообщения = НСтр("es='Para la organización %1 y la subdivisión %2 es indicado ya el modo de la coordinación. Escojan otra organización o la subdivisión.'
		|;ru='Для организации %1 и подразделения %2 уже указан способ согласования. Выберите другую организацию или подразделение.';
		|en='The %1 organization and %2 division already have a matching method specified. Select a different organization or organizational unit.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Организация, Подразделение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("СпособыСогласованияПоУмолчаниюПередОкончаниемРедактирования")
Процедура Расш_гкс_СпособыСогласованияПоУмолчаниюПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		Элемент.ТекущиеДанные.ВидДокумента = ТекущийВидДокумента;
	КонецЕсли;

	текСтрока = Элемент.ТекущиеДанные;
	Если текСтрока <> Неопределено И Не ОтменаРедактирования Тогда
		#Удаление
		Если ПроверитьДублиСтрок(текСтрока.ВидДокумента, текСтрока.Организация, текСтрока.Подразделение) Тогда
		#КонецУдаления
		#Вставка
		Если гкс_ПроверитьДублиСтрок(текСтрока.ВидДокумента, текСтрока.Организация, 
				текСтрока.Подразделение, текСтрока.гкс_ПодразделениеИсполнитель) Тогда
		#КонецВставки
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере1(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТЗСпособовСогласования")
Процедура Расш_гкс_ЗаполнитьТЗСпособовСогласования()

	ТаблицаДокументов = РеквизитФормыВЗначение("СпособыСогласованияПоУмолчанию");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента,
	|	торо_НастройкиСогласованияДокументовТОиР.Организация,
	|	торо_НастройкиСогласованияДокументовТОиР.Подразделение,
	#Вставка
	|	торо_НастройкиСогласованияДокументовТОиР.гкс_ПодразделениеИсполнитель,
	#КонецВставки
	|	торо_НастройкиСогласованияДокументовТОиР.СпособСогласования
	|ИЗ
	|	РегистрСведений.торо_НастройкиСогласованияДокументовТОиР КАК торо_НастройкиСогласованияДокументовТОиР
	|ГДЕ
	|	торо_НастройкиСогласованияДокументовТОиР.ВидДокумента <> НЕОПРЕДЕЛЕНО";


	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();

	ЗначениеВРеквизитФормы(ТаблицаДокументов,"СпособыСогласованияПоУмолчанию");

КонецПроцедуры

&НаКлиенте
&После("СогласованиеДокументовРемонтовПриАктивизацииСтроки")
Процедура Расш_гкс_СогласованиеДокументовРемонтовПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.СогласованиеДокументовРемонтов.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		гкс_ВидимостьКолонкиНаСервере(ТекДанные.ВидДокументаСогласования);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_ВидимостьКолонкиНаСервере(ВидДокумента)
	Если ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт
		ИЛИ ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты
		ИЛИ ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот
		ИЛИ ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот Тогда 
		Элементы["Элементгкс_ПодразделениеИсполнитель"].Видимость = Истина;
	Иначе
		Элементы["Элементгкс_ПодразделениеИсполнитель"].Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
